app/views/buy_backs/_form.html.erb

SELECT "carriers".* FROM "carriers"
---
        <strong>Carrier</strong>
      <%= new.select :carrier, ["", "Unlocked", "AT&T", "T-Mobile", "Verizon", "Sprint"] %><%= new.remove_nested_fields_link %> <br>