app/controllers/buy_backs_controller.rb

SELECT  "buy_backs".* FROM "buy_backs" ORDER BY status asc LIMIT ? OFFSET ?  [["LIMIT", 7], ["OFFSET", 0]]
SELECT COUNT(*) FROM "buy_backs"
---
  def index
    @buy_backs = BuyBack.order(sort_column + " " + sort_direction).paginate(page: params[:page], per_page: 7)

INSERT INTO "buy_backs" ("first_name", "last_name", "email", "drive_license", "created_at", "updated_at", "image", "status", "comments", "received_date", "phone_number", "company", "purchase_number", "customer_address") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @buy_back = BuyBack.new(buy_back_params)

    respond_to do |format|
      if @buy_back.save

UPDATE "buy_backs" SET "comments" = ?, "phone_number" = ?, "image" = ?, "updated_at" = ? WHERE "buy_backs"."id" = ?  [["comments", ""], ["phone_number", ""], ["image", "00000PORTRAIT_00000_BURST20180131124526887.jpg"], ["updated_at", "2019-02-07 17:37:36.785491"], ["id", 22]]
---
  def update
    respond_to do |format|
      if @buy_back.update(buy_back_params)

DELETE FROM "buy_backs" WHERE "buy_backs"."id" = ?  [["id", 2]]
---
  def destroy
    @buy_back.destroy

SELECT  "buy_backs".* FROM "buy_backs" WHERE "buy_backs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_buy_back
      @buy_back = BuyBack.find(params[:id])