app/controllers/carriers_controller.rb

  def index
    @carriers = Carrier.all
---
SELECT "carriers".* FROM "carriers"

  def create
    @carrier = Carrier.new(carrier_params)

    respond_to do |format|
      if @carrier.save
---
INSERT INTO "carriers" ("carrier", "created_at", "updated_at") VALUES (?, ?, ?)  [["carrier", "AT&T "], ["created_at", "2019-01-22 17:40:09.204230"], ["updated_at", "2019-01-22 17:40:09.204230"]]

    def set_carrier
      @carrier = Carrier.find(params[:id])
---
SELECT  "carriers".* FROM "carriers" WHERE "carriers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]