app/controllers/device_models_controller.rb

SELECT "device_models".* FROM "device_models"
---
  def index
    @device_models = DeviceModel.all

INSERT INTO "device_models" ("device_carrier", "device_model", "device_sale_price", "device_buy_back_price", "device_repair_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @device_model = DeviceModel.new(device_model_params)

    respond_to do |format|
      if @device_model.save

SELECT  "device_models".* FROM "device_models" WHERE "device_models"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_device_model
      @device_model = DeviceModel.find(params[:id])