app/controllers/devices_controller.rb

  def index
    @devices = Device.all
---
SELECT "devices".* FROM "devices"

  def create
    @device = Device.new(device_params)

    respond_to do |format|
      if @device.save
---
INSERT INTO "devices" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-01-18 21:45:18.249097"], ["updated_at", "2019-01-18 21:45:18.249097"]]

  def destroy
    @device.destroy
---
DELETE FROM "devices" WHERE "devices"."id" = ?  [["id", 8]]

    def set_device
      @device = Device.find(params[:id])
---
SELECT  "devices".* FROM "devices" WHERE "devices"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]